docs/posts/2015-01-17-why-jekyll.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 21, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Why Jekyll?</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/neat.css' type='text/css'/>
<link rel='stylesheet' href='/css/custom.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Why Jekyll?</h1>
<p class="subtitle" role="doc-subtitle">Jan 17, 2015</p>
</header><section id="outline-container-org2f67923" class="outline-2">
<h2 id="org2f67923">Same Old Story</h2>
<div class="outline-text-2" id="text-org2f67923">
<p>
It must be that time of year again — the time that I do something new with the blog. I&rsquo;m not sure that I could remember all of the tools that I&rsquo;ve used to build web sites in the past:
</p>

<ul class="org-ul">
<li>Microsoft FrontPage (Those were dark days, indeed.)</li>
<li>Something that I vaguely remember being produced by Netscape</li>
<li>RapidWeaver</li>
<li>Blogger</li>
<li>RubyFrontier</li>
<li>Wordpress</li>
<li>Octopress</li>
<li>Statamic</li>
<li>Ghost</li>
<li>Squarespace</li>
</ul>

<p>
I&rsquo;m probably forgetting something, but you get the point. The problem is that none of these met all of my criteria for a good system. The last four are definitely viable, each have strengths and weaknesses. With Wordpress, Ghost, and Squarespace, I was able to post from my iPad when I didn&rsquo;t have access to the computer. With Octopress, I was able to keep an up-to-date copy of all posts in their native Markdown format. Posting from iOS with Octopress was possible, but tricky. With Squarespace, I could write the original post in my preferred text editor, then copy and paste into the Markdown field. If I later edited the post online, I would have to remember to update the stored file on the computer. I could download a backup, but it was an XML file, no longer Markdown. Statamic is a good solution, and if I had to design a site for a non-tech-savvy client, I would probably go with it.
</p>
</div>
</section>
<section id="outline-container-org882713f" class="outline-2">
<h2 id="org882713f">What I&rsquo;m Looking For</h2>
<div class="outline-text-2" id="text-org882713f">
<p>
Here are the features I wanted:
</p>

<ul class="org-ul">
<li>Inexpensive — I teach at a private, tuition-driven, liberal arts college.</li>
<li>Write in Markdown.</li>
<li>Write with Emacs.</li>
<li>Use some Markdown extension for footnotes<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup> and tables.</li>
<li>Typeset math with MathJax.</li>
<li>Easily keep an updated copy of all posts in their native format.</li>
<li>Occasionally write and publish a post with my iPad.</li>
<li>Control over the aesthetics of the site.</li>
</ul>

<p>
<a href="http://scriptogr.am">Scriptogram</a> looked ideal, with posts built from Markdown files kept in Dropbox. The problem is that services like Scriptogram have been shutting down, because they weren&rsquo;t sustainable. There are some services that looked like they had a plan for sustainability, like <a href="https://www.silvrback.com ">Silvrback</a> and <a href="https://posthaven.com ">Posthaven</a>, but they didn&rsquo;t seem to meet my needs any better than Ghost.
</p>

<p>
I copied everything from Squarespace and built an Octopress site, deciding to live with the mobile posting problem. Octopress seems to take a bit of time to build, which could be annoying as the site gets larger, but that&rsquo;s a minor complaint. <a href="http://hexo.io ">Hexo</a> is fast, but most of the users seem to be Chinese, and like Blanche DuBois, I tend to rely on the kindness of strangers, at least I rely on others to have written about how to solve certain problems.
</p>
</div>
</section>
<section id="outline-container-orgeb6b232" class="outline-2">
<h2 id="orgeb6b232">Jekyll to the Rescue</h2>
<div class="outline-text-2" id="text-orgeb6b232">
<p>
I&rsquo;ve played with <a href="http://jekyllrb.com ">Jekyll</a> in the past, but didn&rsquo;t find it very friendly unless packaged in Octopress. I decided to give Jekyll another try. It turned out to be fairly easy to set up, and I believe it has all of the features that I wanted. I&rsquo;m publish to Github Pages, so it&rsquo;s free. I&rsquo;m using an extension of Markdown called Kramdown that has footnotes, tables, and MathJax support. I not only have a local copy of my posts, but they&rsquo;re all under version control, backed up on Github. I found a very nice theme that I was able to use to fairly closely replicate my Squarespace site. Finally, I can write and publish a post on the Github web site, which is then copied to my computer the next time I publish. Of course, Emacs is able to automate much of the process.
</p>

<p>
So, here is the new Jekyll site.
</p>

<p>
UPDATE: I should have mentioned that the day I deployed the new Jekyll site, Brandon Mathis posted information about <a href="http://octopress.org/2015/01/15/octopress-3.0-is-coming/">Octopress 3</a>.
</p>

<p>
It sounds interesting, and I&rsquo;ll have to keep an eye on it. I saw <a href="http://www.websrvr.in/?utm_source=getsimpleform.com&amp;utm_medium=nav&amp;utm_campaign=simpleform1%20">websrvr</a> this morning. It builds from Dropbox, but is a paid service, so it might be something that sticks around.<sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup> It certainly looks worth a test run.
</p>
</div>
</section>
<div id="footnotes">
<h2 class="footnotes">Footnotes</h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
What can I say&#x2026; I&rsquo;m an academic.
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2" role="doc-backlink">2</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
It&rsquo;s only one dollar per month, so the cost is insignificant. I certainly like free, but I&rsquo;m leery of depending on something when I can&rsquo;t figure out how the people responsible are managing to pay their bills.
</p></div></div>


</div>
</div></main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 21, 2024. Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
